GopalSaraf/Practicals/PSDL/include/proc/pic16lf1618.inc
// Register: PID1SETL
#define PID1SETL PID1SETL
PID1SETL                                 equ 058Ch
// bitfield definitions
PID1SETL_PID1SET0_POSN                   equ 0000h
PID1SETL_PID1SET0_POSITION               equ 0000h
PID1SETL_PID1SET0_SIZE                   equ 0001h
PID1SETL_PID1SET0_LENGTH                 equ 0001h
PID1SETL_PID1SET0_MASK                   equ 0001h
PID1SETL_PID1SET1_POSN                   equ 0001h
PID1SETL_PID1SET1_POSITION               equ 0001h
PID1SETL_PID1SET1_SIZE                   equ 0001h
PID1SETL_PID1SET1_LENGTH                 equ 0001h
PID1SETL_PID1SET1_MASK                   equ 0002h
PID1SETL_PID1SET2_POSN                   equ 0002h
PID1SETL_PID1SET2_POSITION               equ 0002h
PID1SETL_PID1SET2_SIZE                   equ 0001h
PID1SETL_PID1SET2_LENGTH                 equ 0001h
PID1SETL_PID1SET2_MASK                   equ 0004h
PID1SETL_PID1SET3_POSN                   equ 0003h
PID1SETL_PID1SET3_POSITION               equ 0003h
PID1SETL_PID1SET3_SIZE                   equ 0001h
PID1SETL_PID1SET3_LENGTH                 equ 0001h
PID1SETL_PID1SET3_MASK                   equ 0008h
PID1SETL_PID1SET4_POSN                   equ 0004h
PID1SETL_PID1SET4_POSITION               equ 0004h
PID1SETL_PID1SET4_SIZE                   equ 0001h
PID1SETL_PID1SET4_LENGTH                 equ 0001h
PID1SETL_PID1SET4_MASK                   equ 0010h
PID1SETL_PID1SET5_POSN                   equ 0005h
PID1SETL_PID1SET5_POSITION               equ 0005h
PID1SETL_PID1SET5_SIZE                   equ 0001h
PID1SETL_PID1SET5_LENGTH                 equ 0001h
PID1SETL_PID1SET5_MASK                   equ 0020h
PID1SETL_PID1SET6_POSN                   equ 0006h
PID1SETL_PID1SET6_POSITION               equ 0006h
PID1SETL_PID1SET6_SIZE                   equ 0001h
PID1SETL_PID1SET6_LENGTH                 equ 0001h
PID1SETL_PID1SET6_MASK                   equ 0040h
PID1SETL_PID1SET7_POSN                   equ 0007h
PID1SETL_PID1SET7_POSITION               equ 0007h
PID1SETL_PID1SET7_SIZE                   equ 0001h
PID1SETL_PID1SET7_LENGTH                 equ 0001h
PID1SETL_PID1SET7_MASK                   equ 0080h
PID1SETL_SET0_POSN                       equ 0000h
PID1SETL_SET0_POSITION                   equ 0000h
PID1SETL_SET0_SIZE                       equ 0001h
PID1SETL_SET0_LENGTH                     equ 0001h
PID1SETL_SET0_MASK                       equ 0001h
PID1SETL_SET1_POSN                       equ 0001h
PID1SETL_SET1_POSITION                   equ 0001h
PID1SETL_SET1_SIZE                       equ 0001h
PID1SETL_SET1_LENGTH                     equ 0001h
PID1SETL_SET1_MASK                       equ 0002h
PID1SETL_SET2_POSN                       equ 0002h
PID1SETL_SET2_POSITION                   equ 0002h
PID1SETL_SET2_SIZE                       equ 0001h
PID1SETL_SET2_LENGTH                     equ 0001h
PID1SETL_SET2_MASK                       equ 0004h
PID1SETL_SET3_POSN                       equ 0003h
PID1SETL_SET3_POSITION                   equ 0003h
PID1SETL_SET3_SIZE                       equ 0001h
PID1SETL_SET3_LENGTH                     equ 0001h
PID1SETL_SET3_MASK                       equ 0008h
PID1SETL_SET4_POSN                       equ 0004h
PID1SETL_SET4_POSITION                   equ 0004h
PID1SETL_SET4_SIZE                       equ 0001h
PID1SETL_SET4_LENGTH                     equ 0001h
PID1SETL_SET4_MASK                       equ 0010h
PID1SETL_SET5_POSN                       equ 0005h
PID1SETL_SET5_POSITION                   equ 0005h
PID1SETL_SET5_SIZE                       equ 0001h
PID1SETL_SET5_LENGTH                     equ 0001h
PID1SETL_SET5_MASK                       equ 0020h
PID1SETL_SET6_POSN                       equ 0006h
PID1SETL_SET6_POSITION                   equ 0006h
PID1SETL_SET6_SIZE                       equ 0001h
PID1SETL_SET6_LENGTH                     equ 0001h
PID1SETL_SET6_MASK                       equ 0040h
PID1SETL_SET7_POSN                       equ 0007h
PID1SETL_SET7_POSITION                   equ 0007h
PID1SETL_SET7_SIZE                       equ 0001h
PID1SETL_SET7_LENGTH                     equ 0001h
PID1SETL_SET7_MASK                       equ 0080h

// Register: PID1SETH
#define PID1SETH PID1SETH
PID1SETH                                 equ 058Dh
// bitfield definitions
PID1SETH_PID1SET8_POSN                   equ 0000h
PID1SETH_PID1SET8_POSITION               equ 0000h
PID1SETH_PID1SET8_SIZE                   equ 0001h
PID1SETH_PID1SET8_LENGTH                 equ 0001h
PID1SETH_PID1SET8_MASK                   equ 0001h
PID1SETH_PID1SET9_POSN                   equ 0001h
PID1SETH_PID1SET9_POSITION               equ 0001h
PID1SETH_PID1SET9_SIZE                   equ 0001h
PID1SETH_PID1SET9_LENGTH                 equ 0001h
PID1SETH_PID1SET9_MASK                   equ 0002h
PID1SETH_PID1SET10_POSN                  equ 0002h
PID1SETH_PID1SET10_POSITION              equ 0002h
PID1SETH_PID1SET10_SIZE                  equ 0001h
PID1SETH_PID1SET10_LENGTH                equ 0001h
PID1SETH_PID1SET10_MASK                  equ 0004h
PID1SETH_PID1SET11_POSN                  equ 0003h
PID1SETH_PID1SET11_POSITION              equ 0003h
PID1SETH_PID1SET11_SIZE                  equ 0001h
PID1SETH_PID1SET11_LENGTH                equ 0001h
PID1SETH_PID1SET11_MASK                  equ 0008h
PID1SETH_PID1SET12_POSN                  equ 0004h
PID1SETH_PID1SET12_POSITION              equ 0004h
PID1SETH_PID1SET12_SIZE                  equ 0001h
PID1SETH_PID1SET12_LENGTH                equ 0001h
PID1SETH_PID1SET12_MASK                  equ 0010h
PID1SETH_PID1SET13_POSN                  equ 0005h
PID1SETH_PID1SET13_POSITION              equ 0005h
PID1SETH_PID1SET13_SIZE                  equ 0001h
PID1SETH_PID1SET13_LENGTH                equ 0001h
PID1SETH_PID1SET13_MASK                  equ 0020h
PID1SETH_PID1SET14_POSN                  equ 0006h
PID1SETH_PID1SET14_POSITION              equ 0006h
PID1SETH_PID1SET14_SIZE                  equ 0001h
PID1SETH_PID1SET14_LENGTH                equ 0001h
PID1SETH_PID1SET14_MASK                  equ 0040h
PID1SETH_PID1SET15_POSN                  equ 0007h
PID1SETH_PID1SET15_POSITION              equ 0007h
PID1SETH_PID1SET15_SIZE                  equ 0001h
PID1SETH_PID1SET15_LENGTH                equ 0001h
PID1SETH_PID1SET15_MASK                  equ 0080h
PID1SETH_SET8_POSN                       equ 0000h
PID1SETH_SET8_POSITION                   equ 0000h
PID1SETH_SET8_SIZE                       equ 0001h
PID1SETH_SET8_LENGTH                     equ 0001h
PID1SETH_SET8_MASK                       equ 0001h
PID1SETH_SET9_POSN                       equ 0001h
PID1SETH_SET9_POSITION                   equ 0001h
PID1SETH_SET9_SIZE                       equ 0001h
PID1SETH_SET9_LENGTH                     equ 0001h
PID1SETH_SET9_MASK                       equ 0002h
PID1SETH_SET10_POSN                      equ 0002h
PID1SETH_SET10_POSITION                  equ 0002h
PID1SETH_SET10_SIZE                      equ 0001h
PID1SETH_SET10_LENGTH                    equ 0001h
PID1SETH_SET10_MASK                      equ 0004h
PID1SETH_SET11_POSN                      equ 0003h
PID1SETH_SET11_POSITION                  equ 0003h
PID1SETH_SET11_SIZE                      equ 0001h
PID1SETH_SET11_LENGTH                    equ 0001h
PID1SETH_SET11_MASK                      equ 0008h
PID1SETH_SET12_POSN                      equ 0004h
PID1SETH_SET12_POSITION                  equ 0004h
PID1SETH_SET12_SIZE                      equ 0001h
PID1SETH_SET12_LENGTH                    equ 0001h
PID1SETH_SET12_MASK                      equ 0010h
PID1SETH_SET13_POSN                      equ 0005h
PID1SETH_SET13_POSITION                  equ 0005h
PID1SETH_SET13_SIZE                      equ 0001h
PID1SETH_SET13_LENGTH                    equ 0001h
PID1SETH_SET13_MASK                      equ 0020h
PID1SETH_SET14_POSN                      equ 0006h
PID1SETH_SET14_POSITION                  equ 0006h
PID1SETH_SET14_SIZE                      equ 0001h
PID1SETH_SET14_LENGTH                    equ 0001h
PID1SETH_SET14_MASK                      equ 0040h
PID1SETH_SET15_POSN                      equ 0007h
PID1SETH_SET15_POSITION                  equ 0007h
PID1SETH_SET15_SIZE                      equ 0001h
PID1SETH_SET15_LENGTH                    equ 0001h
PID1SETH_SET15_MASK                      equ 0080h

// Register: PID1INL
#define PID1INL PID1INL
PID1INL                                  equ 058Eh
// bitfield definitions
PID1INL_PID1IN0_POSN                     equ 0000h
PID1INL_PID1IN0_POSITION                 equ 0000h
PID1INL_PID1IN0_SIZE                     equ 0001h
PID1INL_PID1IN0_LENGTH                   equ 0001h
PID1INL_PID1IN0_MASK                     equ 0001h
PID1INL_PID1IN1_POSN                     equ 0001h
PID1INL_PID1IN1_POSITION                 equ 0001h
PID1INL_PID1IN1_SIZE                     equ 0001h
PID1INL_PID1IN1_LENGTH                   equ 0001h
PID1INL_PID1IN1_MASK                     equ 0002h
PID1INL_PID1IN2_POSN                     equ 0002h
PID1INL_PID1IN2_POSITION                 equ 0002h
PID1INL_PID1IN2_SIZE                     equ 0001h
PID1INL_PID1IN2_LENGTH                   equ 0001h
PID1INL_PID1IN2_MASK                     equ 0004h
PID1INL_PID1IN3_POSN                     equ 0003h
PID1INL_PID1IN3_POSITION                 equ 0003h
PID1INL_PID1IN3_SIZE                     equ 0001h
PID1INL_PID1IN3_LENGTH                   equ 0001h
PID1INL_PID1IN3_MASK                     equ 0008h
PID1INL_PID1IN4_POSN                     equ 0004h
PID1INL_PID1IN4_POSITION                 equ 0004h
PID1INL_PID1IN4_SIZE                     equ 0001h
PID1INL_PID1IN4_LENGTH                   equ 0001h
PID1INL_PID1IN4_MASK                     equ 0010h
PID1INL_PID1IN5_POSN                     equ 0005h
PID1INL_PID1IN5_POSITION                 equ 0005h
PID1INL_PID1IN5_SIZE                     equ 0001h
PID1INL_PID1IN5_LENGTH                   equ 0001h
PID1INL_PID1IN5_MASK                     equ 0020h
PID1INL_PID1IN6_POSN                     equ 0006h
PID1INL_PID1IN6_POSITION                 equ 0006h
PID1INL_PID1IN6_SIZE                     equ 0001h
PID1INL_PID1IN6_LENGTH                   equ 0001h
PID1INL_PID1IN6_MASK                     equ 0040h
PID1INL_PID1IN7_POSN                     equ 0007h
PID1INL_PID1IN7_POSITION                 equ 0007h
PID1INL_PID1IN7_SIZE                     equ 0001h
PID1INL_PID1IN7_LENGTH                   equ 0001h
PID1INL_PID1IN7_MASK                     equ 0080h
PID1INL_IN0_POSN                         equ 0000h
PID1INL_IN0_POSITION                     equ 0000h
PID1INL_IN0_SIZE                         equ 0001h
PID1INL_IN0_LENGTH                       equ 0001h
PID1INL_IN0_MASK                         equ 0001h
PID1INL_IN1_POSN                         equ 0001h
PID1INL_IN1_POSITION                     equ 0001h
PID1INL_IN1_SIZE                         equ 0001h
PID1INL_IN1_LENGTH                       equ 0001h
PID1INL_IN1_MASK                         equ 0002h
PID1INL_IN2_POSN                         equ 0002h
PID1INL_IN2_POSITION                     equ 0002h
PID1INL_IN2_SIZE                         equ 0001h
PID1INL_IN2_LENGTH                       equ 0001h
PID1INL_IN2_MASK                         equ 0004h
PID1INL_IN3_POSN                         equ 0003h
PID1INL_IN3_POSITION                     equ 0003h
PID1INL_IN3_SIZE                         equ 0001h
PID1INL_IN3_LENGTH                       equ 0001h
PID1INL_IN3_MASK                         equ 0008h
PID1INL_IN4_POSN                         equ 0004h
PID1INL_IN4_POSITION                     equ 0004h
PID1INL_IN4_SIZE                         equ 0001h
PID1INL_IN4_LENGTH                       equ 0001h
PID1INL_IN4_MASK                         equ 0010h
PID1INL_IN5_POSN                         equ 0005h
PID1INL_IN5_POSITION                     equ 0005h
PID1INL_IN5_SIZE                         equ 0001h
PID1INL_IN5_LENGTH                       equ 0001h
PID1INL_IN5_MASK                         equ 0020h
PID1INL_IN6_POSN                         equ 0006h
PID1INL_IN6_POSITION                     equ 0006h
PID1INL_IN6_SIZE                         equ 0001h
PID1INL_IN6_LENGTH                       equ 0001h
PID1INL_IN6_MASK                         equ 0040h
PID1INL_IN7_POSN                         equ 0007h
PID1INL_IN7_POSITION                     equ 0007h
PID1INL_IN7_SIZE                         equ 0001h
PID1INL_IN7_LENGTH                       equ 0001h
PID1INL_IN7_MASK                         equ 0080h

// Register: PID1INH
#define PID1INH PID1INH
PID1INH                                  equ 058Fh
// bitfield definitions
PID1INH_PID1IN8_POSN                     equ 0000h
PID1INH_PID1IN8_POSITION                 equ 0000h
PID1INH_PID1IN8_SIZE                     equ 0001h
PID1INH_PID1IN8_LENGTH                   equ 0001h
PID1INH_PID1IN8_MASK                     equ 0001h
PID1INH_PID1IN9_POSN                     equ 0001h
PID1INH_PID1IN9_POSITION                 equ 0001h
PID1INH_PID1IN9_SIZE                     equ 0001h
PID1INH_PID1IN9_LENGTH                   equ 0001h
PID1INH_PID1IN9_MASK                     equ 0002h
PID1INH_PID1IN10_POSN                    equ 0002h
PID1INH_PID1IN10_POSITION                equ 0002h
PID1INH_PID1IN10_SIZE                    equ 0001h
PID1INH_PID1IN10_LENGTH                  equ 0001h
PID1INH_PID1IN10_MASK                    equ 0004h
PID1INH_PID1IN11_POSN                    equ 0003h
PID1INH_PID1IN11_POSITION                equ 0003h
PID1INH_PID1IN11_SIZE                    equ 0001h
PID1INH_PID1IN11_LENGTH                  equ 0001h
PID1INH_PID1IN11_MASK                    equ 0008h
PID1INH_PID1IN12_POSN                    equ 0004h
PID1INH_PID1IN12_POSITION                equ 0004h
PID1INH_PID1IN12_SIZE                    equ 0001h
PID1INH_PID1IN12_LENGTH                  equ 0001h
PID1INH_PID1IN12_MASK                    equ 0010h
PID1INH_PID1IN13_POSN                    equ 0005h
PID1INH_PID1IN13_POSITION                equ 0005h
PID1INH_PID1IN13_SIZE                    equ 0001h
PID1INH_PID1IN13_LENGTH                  equ 0001h
PID1INH_PID1IN13_MASK                    equ 0020h
PID1INH_PID1IN14_POSN                    equ 0006h
PID1INH_PID1IN14_POSITION                equ 0006h
PID1INH_PID1IN14_SIZE                    equ 0001h
PID1INH_PID1IN14_LENGTH                  equ 0001h
PID1INH_PID1IN14_MASK                    equ 0040h
PID1INH_PID1IN15_POSN                    equ 0007h
PID1INH_PID1IN15_POSITION                equ 0007h
PID1INH_PID1IN15_SIZE                    equ 0001h
PID1INH_PID1IN15_LENGTH                  equ 0001h
PID1INH_PID1IN15_MASK                    equ 0080h
PID1INH_IN8_POSN                         equ 0000h
PID1INH_IN8_POSITION                     equ 0000h
PID1INH_IN8_SIZE                         equ 0001h
PID1INH_IN8_LENGTH                       equ 0001h
PID1INH_IN8_MASK                         equ 0001h
PID1INH_IN9_POSN                         equ 0001h
PID1INH_IN9_POSITION                     equ 0001h
PID1INH_IN9_SIZE                         equ 0001h
PID1INH_IN9_LENGTH                       equ 0001h
PID1INH_IN9_MASK                         equ 0002h
PID1INH_IN10_POSN                        equ 0002h
PID1INH_IN10_POSITION                    equ 0002h
PID1INH_IN10_SIZE                        equ 0001h
PID1INH_IN10_LENGTH                      equ 0001h
PID1INH_IN10_MASK                        equ 0004h
PID1INH_IN11_POSN                        equ 0003h
PID1INH_IN11_POSITION                    equ 0003h
PID1INH_IN11_SIZE                        equ 0001h
PID1INH_IN11_LENGTH                      equ 0001h
PID1INH_IN11_MASK                        equ 0008h
PID1INH_IN12_POSN                        equ 0004h
PID1INH_IN12_POSITION                    equ 0004h
PID1INH_IN12_SIZE                        equ 0001h
PID1INH_IN12_LENGTH                      equ 0001h
PID1INH_IN12_MASK                        equ 0010h
PID1INH_IN13_POSN                        equ 0005h
PID1INH_IN13_POSITION                    equ 0005h
PID1INH_IN13_SIZE                        equ 0001h
PID1INH_IN13_LENGTH                      equ 0001h
PID1INH_IN13_MASK                        equ 0020h
PID1INH_IN14_POSN                        equ 0006h
PID1INH_IN14_POSITION                    equ 0006h
PID1INH_IN14_SIZE                        equ 0001h
PID1INH_IN14_LENGTH                      equ 0001h
PID1INH_IN14_MASK                        equ 0040h
PID1INH_IN15_POSN                        equ 0007h
PID1INH_IN15_POSITION                    equ 0007h
PID1INH_IN15_SIZE                        equ 0001h
PID1INH_IN15_LENGTH                      equ 0001h
PID1INH_IN15_MASK                        equ 0080h

