GopalSaraf/Practicals/PSDL/include/proc/pic16lf1618.inc
// Register: PID1K1L
#define PID1K1L PID1K1L
PID1K1L                                  equ 0590h
// bitfield definitions
PID1K1L_PID1K10_POSN                     equ 0000h
PID1K1L_PID1K10_POSITION                 equ 0000h
PID1K1L_PID1K10_SIZE                     equ 0001h
PID1K1L_PID1K10_LENGTH                   equ 0001h
PID1K1L_PID1K10_MASK                     equ 0001h
PID1K1L_PID1K11_POSN                     equ 0001h
PID1K1L_PID1K11_POSITION                 equ 0001h
PID1K1L_PID1K11_SIZE                     equ 0001h
PID1K1L_PID1K11_LENGTH                   equ 0001h
PID1K1L_PID1K11_MASK                     equ 0002h
PID1K1L_PID1K12_POSN                     equ 0002h
PID1K1L_PID1K12_POSITION                 equ 0002h
PID1K1L_PID1K12_SIZE                     equ 0001h
PID1K1L_PID1K12_LENGTH                   equ 0001h
PID1K1L_PID1K12_MASK                     equ 0004h
PID1K1L_PID1K13_POSN                     equ 0003h
PID1K1L_PID1K13_POSITION                 equ 0003h
PID1K1L_PID1K13_SIZE                     equ 0001h
PID1K1L_PID1K13_LENGTH                   equ 0001h
PID1K1L_PID1K13_MASK                     equ 0008h
PID1K1L_PID1K14_POSN                     equ 0004h
PID1K1L_PID1K14_POSITION                 equ 0004h
PID1K1L_PID1K14_SIZE                     equ 0001h
PID1K1L_PID1K14_LENGTH                   equ 0001h
PID1K1L_PID1K14_MASK                     equ 0010h
PID1K1L_PID1K15_POSN                     equ 0005h
PID1K1L_PID1K15_POSITION                 equ 0005h
PID1K1L_PID1K15_SIZE                     equ 0001h
PID1K1L_PID1K15_LENGTH                   equ 0001h
PID1K1L_PID1K15_MASK                     equ 0020h
PID1K1L_PID1K16_POSN                     equ 0006h
PID1K1L_PID1K16_POSITION                 equ 0006h
PID1K1L_PID1K16_SIZE                     equ 0001h
PID1K1L_PID1K16_LENGTH                   equ 0001h
PID1K1L_PID1K16_MASK                     equ 0040h
PID1K1L_PID1K17_POSN                     equ 0007h
PID1K1L_PID1K17_POSITION                 equ 0007h
PID1K1L_PID1K17_SIZE                     equ 0001h
PID1K1L_PID1K17_LENGTH                   equ 0001h
PID1K1L_PID1K17_MASK                     equ 0080h
PID1K1L_K10_POSN                         equ 0000h
PID1K1L_K10_POSITION                     equ 0000h
PID1K1L_K10_SIZE                         equ 0001h
PID1K1L_K10_LENGTH                       equ 0001h
PID1K1L_K10_MASK                         equ 0001h
PID1K1L_K11_POSN                         equ 0001h
PID1K1L_K11_POSITION                     equ 0001h
PID1K1L_K11_SIZE                         equ 0001h
PID1K1L_K11_LENGTH                       equ 0001h
PID1K1L_K11_MASK                         equ 0002h
PID1K1L_K12_POSN                         equ 0002h
PID1K1L_K12_POSITION                     equ 0002h
PID1K1L_K12_SIZE                         equ 0001h
PID1K1L_K12_LENGTH                       equ 0001h
PID1K1L_K12_MASK                         equ 0004h
PID1K1L_K13_POSN                         equ 0003h
PID1K1L_K13_POSITION                     equ 0003h
PID1K1L_K13_SIZE                         equ 0001h
PID1K1L_K13_LENGTH                       equ 0001h
PID1K1L_K13_MASK                         equ 0008h
PID1K1L_K14_POSN                         equ 0004h
PID1K1L_K14_POSITION                     equ 0004h
PID1K1L_K14_SIZE                         equ 0001h
PID1K1L_K14_LENGTH                       equ 0001h
PID1K1L_K14_MASK                         equ 0010h
PID1K1L_K15_POSN                         equ 0005h
PID1K1L_K15_POSITION                     equ 0005h
PID1K1L_K15_SIZE                         equ 0001h
PID1K1L_K15_LENGTH                       equ 0001h
PID1K1L_K15_MASK                         equ 0020h
PID1K1L_K16_POSN                         equ 0006h
PID1K1L_K16_POSITION                     equ 0006h
PID1K1L_K16_SIZE                         equ 0001h
PID1K1L_K16_LENGTH                       equ 0001h
PID1K1L_K16_MASK                         equ 0040h
PID1K1L_K17_POSN                         equ 0007h
PID1K1L_K17_POSITION                     equ 0007h
PID1K1L_K17_SIZE                         equ 0001h
PID1K1L_K17_LENGTH                       equ 0001h
PID1K1L_K17_MASK                         equ 0080h

// Register: PID1K1H
#define PID1K1H PID1K1H
PID1K1H                                  equ 0591h
// bitfield definitions
PID1K1H_PID1K18_POSN                     equ 0000h
PID1K1H_PID1K18_POSITION                 equ 0000h
PID1K1H_PID1K18_SIZE                     equ 0001h
PID1K1H_PID1K18_LENGTH                   equ 0001h
PID1K1H_PID1K18_MASK                     equ 0001h
PID1K1H_PID1K19_POSN                     equ 0001h
PID1K1H_PID1K19_POSITION                 equ 0001h
PID1K1H_PID1K19_SIZE                     equ 0001h
PID1K1H_PID1K19_LENGTH                   equ 0001h
PID1K1H_PID1K19_MASK                     equ 0002h
PID1K1H_PID1K110_POSN                    equ 0002h
PID1K1H_PID1K110_POSITION                equ 0002h
PID1K1H_PID1K110_SIZE                    equ 0001h
PID1K1H_PID1K110_LENGTH                  equ 0001h
PID1K1H_PID1K110_MASK                    equ 0004h
PID1K1H_PID1K111_POSN                    equ 0003h
PID1K1H_PID1K111_POSITION                equ 0003h
PID1K1H_PID1K111_SIZE                    equ 0001h
PID1K1H_PID1K111_LENGTH                  equ 0001h
PID1K1H_PID1K111_MASK                    equ 0008h
PID1K1H_PID1K112_POSN                    equ 0004h
PID1K1H_PID1K112_POSITION                equ 0004h
PID1K1H_PID1K112_SIZE                    equ 0001h
PID1K1H_PID1K112_LENGTH                  equ 0001h
PID1K1H_PID1K112_MASK                    equ 0010h
PID1K1H_PID1K113_POSN                    equ 0005h
PID1K1H_PID1K113_POSITION                equ 0005h
PID1K1H_PID1K113_SIZE                    equ 0001h
PID1K1H_PID1K113_LENGTH                  equ 0001h
PID1K1H_PID1K113_MASK                    equ 0020h
PID1K1H_PID1K114_POSN                    equ 0006h
PID1K1H_PID1K114_POSITION                equ 0006h
PID1K1H_PID1K114_SIZE                    equ 0001h
PID1K1H_PID1K114_LENGTH                  equ 0001h
PID1K1H_PID1K114_MASK                    equ 0040h
PID1K1H_PID1K115_POSN                    equ 0007h
PID1K1H_PID1K115_POSITION                equ 0007h
PID1K1H_PID1K115_SIZE                    equ 0001h
PID1K1H_PID1K115_LENGTH                  equ 0001h
PID1K1H_PID1K115_MASK                    equ 0080h
PID1K1H_K18_POSN                         equ 0000h
PID1K1H_K18_POSITION                     equ 0000h
PID1K1H_K18_SIZE                         equ 0001h
PID1K1H_K18_LENGTH                       equ 0001h
PID1K1H_K18_MASK                         equ 0001h
PID1K1H_K19_POSN                         equ 0001h
PID1K1H_K19_POSITION                     equ 0001h
PID1K1H_K19_SIZE                         equ 0001h
PID1K1H_K19_LENGTH                       equ 0001h
PID1K1H_K19_MASK                         equ 0002h
PID1K1H_K110_POSN                        equ 0002h
PID1K1H_K110_POSITION                    equ 0002h
PID1K1H_K110_SIZE                        equ 0001h
PID1K1H_K110_LENGTH                      equ 0001h
PID1K1H_K110_MASK                        equ 0004h
PID1K1H_K111_POSN                        equ 0003h
PID1K1H_K111_POSITION                    equ 0003h
PID1K1H_K111_SIZE                        equ 0001h
PID1K1H_K111_LENGTH                      equ 0001h
PID1K1H_K111_MASK                        equ 0008h
PID1K1H_K112_POSN                        equ 0004h
PID1K1H_K112_POSITION                    equ 0004h
PID1K1H_K112_SIZE                        equ 0001h
PID1K1H_K112_LENGTH                      equ 0001h
PID1K1H_K112_MASK                        equ 0010h
PID1K1H_K113_POSN                        equ 0005h
PID1K1H_K113_POSITION                    equ 0005h
PID1K1H_K113_SIZE                        equ 0001h
PID1K1H_K113_LENGTH                      equ 0001h
PID1K1H_K113_MASK                        equ 0020h
PID1K1H_K114_POSN                        equ 0006h
PID1K1H_K114_POSITION                    equ 0006h
PID1K1H_K114_SIZE                        equ 0001h
PID1K1H_K114_LENGTH                      equ 0001h
PID1K1H_K114_MASK                        equ 0040h
PID1K1H_K115_POSN                        equ 0007h
PID1K1H_K115_POSITION                    equ 0007h
PID1K1H_K115_SIZE                        equ 0001h
PID1K1H_K115_LENGTH                      equ 0001h
PID1K1H_K115_MASK                        equ 0080h

// Register: PID1K2L
#define PID1K2L PID1K2L
PID1K2L                                  equ 0592h
// bitfield definitions
PID1K2L_PID1K20_POSN                     equ 0000h
PID1K2L_PID1K20_POSITION                 equ 0000h
PID1K2L_PID1K20_SIZE                     equ 0001h
PID1K2L_PID1K20_LENGTH                   equ 0001h
PID1K2L_PID1K20_MASK                     equ 0001h
PID1K2L_PID1K21_POSN                     equ 0001h
PID1K2L_PID1K21_POSITION                 equ 0001h
PID1K2L_PID1K21_SIZE                     equ 0001h
PID1K2L_PID1K21_LENGTH                   equ 0001h
PID1K2L_PID1K21_MASK                     equ 0002h
PID1K2L_PID1K22_POSN                     equ 0002h
PID1K2L_PID1K22_POSITION                 equ 0002h
PID1K2L_PID1K22_SIZE                     equ 0001h
PID1K2L_PID1K22_LENGTH                   equ 0001h
PID1K2L_PID1K22_MASK                     equ 0004h
PID1K2L_PID1K23_POSN                     equ 0003h
PID1K2L_PID1K23_POSITION                 equ 0003h
PID1K2L_PID1K23_SIZE                     equ 0001h
PID1K2L_PID1K23_LENGTH                   equ 0001h
PID1K2L_PID1K23_MASK                     equ 0008h
PID1K2L_PID1K24_POSN                     equ 0004h
PID1K2L_PID1K24_POSITION                 equ 0004h
PID1K2L_PID1K24_SIZE                     equ 0001h
PID1K2L_PID1K24_LENGTH                   equ 0001h
PID1K2L_PID1K24_MASK                     equ 0010h
PID1K2L_PID1K25_POSN                     equ 0005h
PID1K2L_PID1K25_POSITION                 equ 0005h
PID1K2L_PID1K25_SIZE                     equ 0001h
PID1K2L_PID1K25_LENGTH                   equ 0001h
PID1K2L_PID1K25_MASK                     equ 0020h
PID1K2L_PID1K26_POSN                     equ 0006h
PID1K2L_PID1K26_POSITION                 equ 0006h
PID1K2L_PID1K26_SIZE                     equ 0001h
PID1K2L_PID1K26_LENGTH                   equ 0001h
PID1K2L_PID1K26_MASK                     equ 0040h
PID1K2L_PID1K27_POSN                     equ 0007h
PID1K2L_PID1K27_POSITION                 equ 0007h
PID1K2L_PID1K27_SIZE                     equ 0001h
PID1K2L_PID1K27_LENGTH                   equ 0001h
PID1K2L_PID1K27_MASK                     equ 0080h
PID1K2L_K20_POSN                         equ 0000h
PID1K2L_K20_POSITION                     equ 0000h
PID1K2L_K20_SIZE                         equ 0001h
PID1K2L_K20_LENGTH                       equ 0001h
PID1K2L_K20_MASK                         equ 0001h
PID1K2L_K21_POSN                         equ 0001h
PID1K2L_K21_POSITION                     equ 0001h
PID1K2L_K21_SIZE                         equ 0001h
PID1K2L_K21_LENGTH                       equ 0001h
PID1K2L_K21_MASK                         equ 0002h
PID1K2L_K22_POSN                         equ 0002h
PID1K2L_K22_POSITION                     equ 0002h
PID1K2L_K22_SIZE                         equ 0001h
PID1K2L_K22_LENGTH                       equ 0001h
PID1K2L_K22_MASK                         equ 0004h
PID1K2L_K23_POSN                         equ 0003h
PID1K2L_K23_POSITION                     equ 0003h
PID1K2L_K23_SIZE                         equ 0001h
PID1K2L_K23_LENGTH                       equ 0001h
PID1K2L_K23_MASK                         equ 0008h
PID1K2L_K24_POSN                         equ 0004h
PID1K2L_K24_POSITION                     equ 0004h
PID1K2L_K24_SIZE                         equ 0001h
PID1K2L_K24_LENGTH                       equ 0001h
PID1K2L_K24_MASK                         equ 0010h
PID1K2L_K25_POSN                         equ 0005h
PID1K2L_K25_POSITION                     equ 0005h
PID1K2L_K25_SIZE                         equ 0001h
PID1K2L_K25_LENGTH                       equ 0001h
PID1K2L_K25_MASK                         equ 0020h
PID1K2L_K26_POSN                         equ 0006h
PID1K2L_K26_POSITION                     equ 0006h
PID1K2L_K26_SIZE                         equ 0001h
PID1K2L_K26_LENGTH                       equ 0001h
PID1K2L_K26_MASK                         equ 0040h
PID1K2L_K27_POSN                         equ 0007h
PID1K2L_K27_POSITION                     equ 0007h
PID1K2L_K27_SIZE                         equ 0001h
PID1K2L_K27_LENGTH                       equ 0001h
PID1K2L_K27_MASK                         equ 0080h

// Register: PID1K2H
#define PID1K2H PID1K2H
PID1K2H                                  equ 0593h
// bitfield definitions
PID1K2H_PID1K28_POSN                     equ 0000h
PID1K2H_PID1K28_POSITION                 equ 0000h
PID1K2H_PID1K28_SIZE                     equ 0001h
PID1K2H_PID1K28_LENGTH                   equ 0001h
PID1K2H_PID1K28_MASK                     equ 0001h
PID1K2H_PID1K29_POSN                     equ 0001h
PID1K2H_PID1K29_POSITION                 equ 0001h
PID1K2H_PID1K29_SIZE                     equ 0001h
PID1K2H_PID1K29_LENGTH                   equ 0001h
PID1K2H_PID1K29_MASK                     equ 0002h
PID1K2H_PID1K210_POSN                    equ 0002h
PID1K2H_PID1K210_POSITION                equ 0002h
PID1K2H_PID1K210_SIZE                    equ 0001h
PID1K2H_PID1K210_LENGTH                  equ 0001h
PID1K2H_PID1K210_MASK                    equ 0004h
PID1K2H_PID1K211_POSN                    equ 0003h
PID1K2H_PID1K211_POSITION                equ 0003h
PID1K2H_PID1K211_SIZE                    equ 0001h
PID1K2H_PID1K211_LENGTH                  equ 0001h
PID1K2H_PID1K211_MASK                    equ 0008h
PID1K2H_PID1K212_POSN                    equ 0004h
PID1K2H_PID1K212_POSITION                equ 0004h
PID1K2H_PID1K212_SIZE                    equ 0001h
PID1K2H_PID1K212_LENGTH                  equ 0001h
PID1K2H_PID1K212_MASK                    equ 0010h
PID1K2H_PID1K213_POSN                    equ 0005h
PID1K2H_PID1K213_POSITION                equ 0005h
PID1K2H_PID1K213_SIZE                    equ 0001h
PID1K2H_PID1K213_LENGTH                  equ 0001h
PID1K2H_PID1K213_MASK                    equ 0020h
PID1K2H_PID1K214_POSN                    equ 0006h
PID1K2H_PID1K214_POSITION                equ 0006h
PID1K2H_PID1K214_SIZE                    equ 0001h
PID1K2H_PID1K214_LENGTH                  equ 0001h
PID1K2H_PID1K214_MASK                    equ 0040h
PID1K2H_PID1K215_POSN                    equ 0007h
PID1K2H_PID1K215_POSITION                equ 0007h
PID1K2H_PID1K215_SIZE                    equ 0001h
PID1K2H_PID1K215_LENGTH                  equ 0001h
PID1K2H_PID1K215_MASK                    equ 0080h
PID1K2H_K28_POSN                         equ 0000h
PID1K2H_K28_POSITION                     equ 0000h
PID1K2H_K28_SIZE                         equ 0001h
PID1K2H_K28_LENGTH                       equ 0001h
PID1K2H_K28_MASK                         equ 0001h
PID1K2H_K29_POSN                         equ 0001h
PID1K2H_K29_POSITION                     equ 0001h
PID1K2H_K29_SIZE                         equ 0001h
PID1K2H_K29_LENGTH                       equ 0001h
PID1K2H_K29_MASK                         equ 0002h
PID1K2H_K210_POSN                        equ 0002h
PID1K2H_K210_POSITION                    equ 0002h
PID1K2H_K210_SIZE                        equ 0001h
PID1K2H_K210_LENGTH                      equ 0001h
PID1K2H_K210_MASK                        equ 0004h
PID1K2H_K211_POSN                        equ 0003h
PID1K2H_K211_POSITION                    equ 0003h
PID1K2H_K211_SIZE                        equ 0001h
PID1K2H_K211_LENGTH                      equ 0001h
PID1K2H_K211_MASK                        equ 0008h
PID1K2H_K212_POSN                        equ 0004h
PID1K2H_K212_POSITION                    equ 0004h
PID1K2H_K212_SIZE                        equ 0001h
PID1K2H_K212_LENGTH                      equ 0001h
PID1K2H_K212_MASK                        equ 0010h
PID1K2H_K213_POSN                        equ 0005h
PID1K2H_K213_POSITION                    equ 0005h
PID1K2H_K213_SIZE                        equ 0001h
PID1K2H_K213_LENGTH                      equ 0001h
PID1K2H_K213_MASK                        equ 0020h
PID1K2H_K214_POSN                        equ 0006h
PID1K2H_K214_POSITION                    equ 0006h
PID1K2H_K214_SIZE                        equ 0001h
PID1K2H_K214_LENGTH                      equ 0001h
PID1K2H_K214_MASK                        equ 0040h
PID1K2H_K215_POSN                        equ 0007h
PID1K2H_K215_POSITION                    equ 0007h
PID1K2H_K215_SIZE                        equ 0001h
PID1K2H_K215_LENGTH                      equ 0001h
PID1K2H_K215_MASK                        equ 0080h

// Register: PID1K3L
#define PID1K3L PID1K3L
PID1K3L                                  equ 0594h
// bitfield definitions
PID1K3L_PID1K30_POSN                     equ 0000h
PID1K3L_PID1K30_POSITION                 equ 0000h
PID1K3L_PID1K30_SIZE                     equ 0001h
PID1K3L_PID1K30_LENGTH                   equ 0001h
PID1K3L_PID1K30_MASK                     equ 0001h
PID1K3L_PID1K31_POSN                     equ 0001h
PID1K3L_PID1K31_POSITION                 equ 0001h
PID1K3L_PID1K31_SIZE                     equ 0001h
PID1K3L_PID1K31_LENGTH                   equ 0001h
PID1K3L_PID1K31_MASK                     equ 0002h
PID1K3L_PID1K32_POSN                     equ 0002h
PID1K3L_PID1K32_POSITION                 equ 0002h
PID1K3L_PID1K32_SIZE                     equ 0001h
PID1K3L_PID1K32_LENGTH                   equ 0001h
PID1K3L_PID1K32_MASK                     equ 0004h
PID1K3L_PID1K33_POSN                     equ 0003h
PID1K3L_PID1K33_POSITION                 equ 0003h
PID1K3L_PID1K33_SIZE                     equ 0001h
PID1K3L_PID1K33_LENGTH                   equ 0001h
PID1K3L_PID1K33_MASK                     equ 0008h
PID1K3L_PID1K34_POSN                     equ 0004h
PID1K3L_PID1K34_POSITION                 equ 0004h
PID1K3L_PID1K34_SIZE                     equ 0001h
PID1K3L_PID1K34_LENGTH                   equ 0001h
PID1K3L_PID1K34_MASK                     equ 0010h
PID1K3L_PID1K35_POSN                     equ 0005h
PID1K3L_PID1K35_POSITION                 equ 0005h
PID1K3L_PID1K35_SIZE                     equ 0001h
PID1K3L_PID1K35_LENGTH                   equ 0001h
PID1K3L_PID1K35_MASK                     equ 0020h
PID1K3L_PID1K36_POSN                     equ 0006h
PID1K3L_PID1K36_POSITION                 equ 0006h
PID1K3L_PID1K36_SIZE                     equ 0001h
PID1K3L_PID1K36_LENGTH                   equ 0001h
PID1K3L_PID1K36_MASK                     equ 0040h
PID1K3L_PID1K37_POSN                     equ 0007h
PID1K3L_PID1K37_POSITION                 equ 0007h
PID1K3L_PID1K37_SIZE                     equ 0001h
PID1K3L_PID1K37_LENGTH                   equ 0001h
PID1K3L_PID1K37_MASK                     equ 0080h
PID1K3L_K30_POSN                         equ 0000h
PID1K3L_K30_POSITION                     equ 0000h
PID1K3L_K30_SIZE                         equ 0001h
PID1K3L_K30_LENGTH                       equ 0001h
PID1K3L_K30_MASK                         equ 0001h
PID1K3L_K31_POSN                         equ 0001h
PID1K3L_K31_POSITION                     equ 0001h
PID1K3L_K31_SIZE                         equ 0001h
PID1K3L_K31_LENGTH                       equ 0001h
PID1K3L_K31_MASK                         equ 0002h
PID1K3L_K32_POSN                         equ 0002h
PID1K3L_K32_POSITION                     equ 0002h
PID1K3L_K32_SIZE                         equ 0001h
PID1K3L_K32_LENGTH                       equ 0001h
PID1K3L_K32_MASK                         equ 0004h
PID1K3L_K33_POSN                         equ 0003h
PID1K3L_K33_POSITION                     equ 0003h
PID1K3L_K33_SIZE                         equ 0001h
PID1K3L_K33_LENGTH                       equ 0001h
PID1K3L_K33_MASK                         equ 0008h
PID1K3L_K34_POSN                         equ 0004h
PID1K3L_K34_POSITION                     equ 0004h
PID1K3L_K34_SIZE                         equ 0001h
PID1K3L_K34_LENGTH                       equ 0001h
PID1K3L_K34_MASK                         equ 0010h
PID1K3L_K35_POSN                         equ 0005h
PID1K3L_K35_POSITION                     equ 0005h
PID1K3L_K35_SIZE                         equ 0001h
PID1K3L_K35_LENGTH                       equ 0001h
PID1K3L_K35_MASK                         equ 0020h
PID1K3L_K36_POSN                         equ 0006h
PID1K3L_K36_POSITION                     equ 0006h
PID1K3L_K36_SIZE                         equ 0001h
PID1K3L_K36_LENGTH                       equ 0001h
PID1K3L_K36_MASK                         equ 0040h
PID1K3L_K37_POSN                         equ 0007h
PID1K3L_K37_POSITION                     equ 0007h
PID1K3L_K37_SIZE                         equ 0001h
PID1K3L_K37_LENGTH                       equ 0001h
PID1K3L_K37_MASK                         equ 0080h

