GopalSaraf/Practicals/PSDL/include/proc/pic16lf1618.inc
// Register: PID1Z2L
#define PID1Z2L PID1Z2L
PID1Z2L                                  equ 060Ch
// bitfield definitions
PID1Z2L_PID1Z20_POSN                     equ 0000h
PID1Z2L_PID1Z20_POSITION                 equ 0000h
PID1Z2L_PID1Z20_SIZE                     equ 0001h
PID1Z2L_PID1Z20_LENGTH                   equ 0001h
PID1Z2L_PID1Z20_MASK                     equ 0001h
PID1Z2L_PID1Z21_POSN                     equ 0001h
PID1Z2L_PID1Z21_POSITION                 equ 0001h
PID1Z2L_PID1Z21_SIZE                     equ 0001h
PID1Z2L_PID1Z21_LENGTH                   equ 0001h
PID1Z2L_PID1Z21_MASK                     equ 0002h
PID1Z2L_PID1Z22_POSN                     equ 0002h
PID1Z2L_PID1Z22_POSITION                 equ 0002h
PID1Z2L_PID1Z22_SIZE                     equ 0001h
PID1Z2L_PID1Z22_LENGTH                   equ 0001h
PID1Z2L_PID1Z22_MASK                     equ 0004h
PID1Z2L_PID1Z23_POSN                     equ 0003h
PID1Z2L_PID1Z23_POSITION                 equ 0003h
PID1Z2L_PID1Z23_SIZE                     equ 0001h
PID1Z2L_PID1Z23_LENGTH                   equ 0001h
PID1Z2L_PID1Z23_MASK                     equ 0008h
PID1Z2L_PID1Z24_POSN                     equ 0004h
PID1Z2L_PID1Z24_POSITION                 equ 0004h
PID1Z2L_PID1Z24_SIZE                     equ 0001h
PID1Z2L_PID1Z24_LENGTH                   equ 0001h
PID1Z2L_PID1Z24_MASK                     equ 0010h
PID1Z2L_PID1Z25_POSN                     equ 0005h
PID1Z2L_PID1Z25_POSITION                 equ 0005h
PID1Z2L_PID1Z25_SIZE                     equ 0001h
PID1Z2L_PID1Z25_LENGTH                   equ 0001h
PID1Z2L_PID1Z25_MASK                     equ 0020h
PID1Z2L_PID1Z26_POSN                     equ 0006h
PID1Z2L_PID1Z26_POSITION                 equ 0006h
PID1Z2L_PID1Z26_SIZE                     equ 0001h
PID1Z2L_PID1Z26_LENGTH                   equ 0001h
PID1Z2L_PID1Z26_MASK                     equ 0040h
PID1Z2L_PID1Z27_POSN                     equ 0007h
PID1Z2L_PID1Z27_POSITION                 equ 0007h
PID1Z2L_PID1Z27_SIZE                     equ 0001h
PID1Z2L_PID1Z27_LENGTH                   equ 0001h
PID1Z2L_PID1Z27_MASK                     equ 0080h
PID1Z2L_Z20_POSN                         equ 0000h
PID1Z2L_Z20_POSITION                     equ 0000h
PID1Z2L_Z20_SIZE                         equ 0001h
PID1Z2L_Z20_LENGTH                       equ 0001h
PID1Z2L_Z20_MASK                         equ 0001h
PID1Z2L_Z21_POSN                         equ 0001h
PID1Z2L_Z21_POSITION                     equ 0001h
PID1Z2L_Z21_SIZE                         equ 0001h
PID1Z2L_Z21_LENGTH                       equ 0001h
PID1Z2L_Z21_MASK                         equ 0002h
PID1Z2L_Z22_POSN                         equ 0002h
PID1Z2L_Z22_POSITION                     equ 0002h
PID1Z2L_Z22_SIZE                         equ 0001h
PID1Z2L_Z22_LENGTH                       equ 0001h
PID1Z2L_Z22_MASK                         equ 0004h
PID1Z2L_Z23_POSN                         equ 0003h
PID1Z2L_Z23_POSITION                     equ 0003h
PID1Z2L_Z23_SIZE                         equ 0001h
PID1Z2L_Z23_LENGTH                       equ 0001h
PID1Z2L_Z23_MASK                         equ 0008h
PID1Z2L_Z24_POSN                         equ 0004h
PID1Z2L_Z24_POSITION                     equ 0004h
PID1Z2L_Z24_SIZE                         equ 0001h
PID1Z2L_Z24_LENGTH                       equ 0001h
PID1Z2L_Z24_MASK                         equ 0010h
PID1Z2L_Z25_POSN                         equ 0005h
PID1Z2L_Z25_POSITION                     equ 0005h
PID1Z2L_Z25_SIZE                         equ 0001h
PID1Z2L_Z25_LENGTH                       equ 0001h
PID1Z2L_Z25_MASK                         equ 0020h
PID1Z2L_Z26_POSN                         equ 0006h
PID1Z2L_Z26_POSITION                     equ 0006h
PID1Z2L_Z26_SIZE                         equ 0001h
PID1Z2L_Z26_LENGTH                       equ 0001h
PID1Z2L_Z26_MASK                         equ 0040h
PID1Z2L_Z27_POSN                         equ 0007h
PID1Z2L_Z27_POSITION                     equ 0007h
PID1Z2L_Z27_SIZE                         equ 0001h
PID1Z2L_Z27_LENGTH                       equ 0001h
PID1Z2L_Z27_MASK                         equ 0080h

// Register: PID1Z2H
#define PID1Z2H PID1Z2H
PID1Z2H                                  equ 060Dh
// bitfield definitions
PID1Z2H_PID1Z28_POSN                     equ 0000h
PID1Z2H_PID1Z28_POSITION                 equ 0000h
PID1Z2H_PID1Z28_SIZE                     equ 0001h
PID1Z2H_PID1Z28_LENGTH                   equ 0001h
PID1Z2H_PID1Z28_MASK                     equ 0001h
PID1Z2H_PID1Z29_POSN                     equ 0001h
PID1Z2H_PID1Z29_POSITION                 equ 0001h
PID1Z2H_PID1Z29_SIZE                     equ 0001h
PID1Z2H_PID1Z29_LENGTH                   equ 0001h
PID1Z2H_PID1Z29_MASK                     equ 0002h
PID1Z2H_PID1Z210_POSN                    equ 0002h
PID1Z2H_PID1Z210_POSITION                equ 0002h
PID1Z2H_PID1Z210_SIZE                    equ 0001h
PID1Z2H_PID1Z210_LENGTH                  equ 0001h
PID1Z2H_PID1Z210_MASK                    equ 0004h
PID1Z2H_PID1Z211_POSN                    equ 0003h
PID1Z2H_PID1Z211_POSITION                equ 0003h
PID1Z2H_PID1Z211_SIZE                    equ 0001h
PID1Z2H_PID1Z211_LENGTH                  equ 0001h
PID1Z2H_PID1Z211_MASK                    equ 0008h
PID1Z2H_PID1Z212_POSN                    equ 0004h
PID1Z2H_PID1Z212_POSITION                equ 0004h
PID1Z2H_PID1Z212_SIZE                    equ 0001h
PID1Z2H_PID1Z212_LENGTH                  equ 0001h
PID1Z2H_PID1Z212_MASK                    equ 0010h
PID1Z2H_PID1Z213_POSN                    equ 0005h
PID1Z2H_PID1Z213_POSITION                equ 0005h
PID1Z2H_PID1Z213_SIZE                    equ 0001h
PID1Z2H_PID1Z213_LENGTH                  equ 0001h
PID1Z2H_PID1Z213_MASK                    equ 0020h
PID1Z2H_PID1Z214_POSN                    equ 0006h
PID1Z2H_PID1Z214_POSITION                equ 0006h
PID1Z2H_PID1Z214_SIZE                    equ 0001h
PID1Z2H_PID1Z214_LENGTH                  equ 0001h
PID1Z2H_PID1Z214_MASK                    equ 0040h
PID1Z2H_PID1Z215_POSN                    equ 0007h
PID1Z2H_PID1Z215_POSITION                equ 0007h
PID1Z2H_PID1Z215_SIZE                    equ 0001h
PID1Z2H_PID1Z215_LENGTH                  equ 0001h
PID1Z2H_PID1Z215_MASK                    equ 0080h
PID1Z2H_Z28_POSN                         equ 0000h
PID1Z2H_Z28_POSITION                     equ 0000h
PID1Z2H_Z28_SIZE                         equ 0001h
PID1Z2H_Z28_LENGTH                       equ 0001h
PID1Z2H_Z28_MASK                         equ 0001h
PID1Z2H_Z29_POSN                         equ 0001h
PID1Z2H_Z29_POSITION                     equ 0001h
PID1Z2H_Z29_SIZE                         equ 0001h
PID1Z2H_Z29_LENGTH                       equ 0001h
PID1Z2H_Z29_MASK                         equ 0002h
PID1Z2H_Z210_POSN                        equ 0002h
PID1Z2H_Z210_POSITION                    equ 0002h
PID1Z2H_Z210_SIZE                        equ 0001h
PID1Z2H_Z210_LENGTH                      equ 0001h
PID1Z2H_Z210_MASK                        equ 0004h
PID1Z2H_Z211_POSN                        equ 0003h
PID1Z2H_Z211_POSITION                    equ 0003h
PID1Z2H_Z211_SIZE                        equ 0001h
PID1Z2H_Z211_LENGTH                      equ 0001h
PID1Z2H_Z211_MASK                        equ 0008h
PID1Z2H_Z212_POSN                        equ 0004h
PID1Z2H_Z212_POSITION                    equ 0004h
PID1Z2H_Z212_SIZE                        equ 0001h
PID1Z2H_Z212_LENGTH                      equ 0001h
PID1Z2H_Z212_MASK                        equ 0010h
PID1Z2H_Z213_POSN                        equ 0005h
PID1Z2H_Z213_POSITION                    equ 0005h
PID1Z2H_Z213_SIZE                        equ 0001h
PID1Z2H_Z213_LENGTH                      equ 0001h
PID1Z2H_Z213_MASK                        equ 0020h
PID1Z2H_Z214_POSN                        equ 0006h
PID1Z2H_Z214_POSITION                    equ 0006h
PID1Z2H_Z214_SIZE                        equ 0001h
PID1Z2H_Z214_LENGTH                      equ 0001h
PID1Z2H_Z214_MASK                        equ 0040h
PID1Z2H_Z215_POSN                        equ 0007h
PID1Z2H_Z215_POSITION                    equ 0007h
PID1Z2H_Z215_SIZE                        equ 0001h
PID1Z2H_Z215_LENGTH                      equ 0001h
PID1Z2H_Z215_MASK                        equ 0080h

