GopalSaraf/Practicals/PSDL/include/proc/pic16lf1618.inc
// Register: CWG1OCON0
#define CWG1OCON0 CWG1OCON0
CWG1OCON0                                equ 0695h
// bitfield definitions
CWG1OCON0_STRA_POSN                      equ 0000h
CWG1OCON0_STRA_POSITION                  equ 0000h
CWG1OCON0_STRA_SIZE                      equ 0001h
CWG1OCON0_STRA_LENGTH                    equ 0001h
CWG1OCON0_STRA_MASK                      equ 0001h
CWG1OCON0_STRB_POSN                      equ 0001h
CWG1OCON0_STRB_POSITION                  equ 0001h
CWG1OCON0_STRB_SIZE                      equ 0001h
CWG1OCON0_STRB_LENGTH                    equ 0001h
CWG1OCON0_STRB_MASK                      equ 0002h
CWG1OCON0_STRC_POSN                      equ 0002h
CWG1OCON0_STRC_POSITION                  equ 0002h
CWG1OCON0_STRC_SIZE                      equ 0001h
CWG1OCON0_STRC_LENGTH                    equ 0001h
CWG1OCON0_STRC_MASK                      equ 0004h
CWG1OCON0_STRD_POSN                      equ 0003h
CWG1OCON0_STRD_POSITION                  equ 0003h
CWG1OCON0_STRD_SIZE                      equ 0001h
CWG1OCON0_STRD_LENGTH                    equ 0001h
CWG1OCON0_STRD_MASK                      equ 0008h
CWG1OCON0_OVRA_POSN                      equ 0004h
CWG1OCON0_OVRA_POSITION                  equ 0004h
CWG1OCON0_OVRA_SIZE                      equ 0001h
CWG1OCON0_OVRA_LENGTH                    equ 0001h
CWG1OCON0_OVRA_MASK                      equ 0010h
CWG1OCON0_OVRB_POSN                      equ 0005h
CWG1OCON0_OVRB_POSITION                  equ 0005h
CWG1OCON0_OVRB_SIZE                      equ 0001h
CWG1OCON0_OVRB_LENGTH                    equ 0001h
CWG1OCON0_OVRB_MASK                      equ 0020h
CWG1OCON0_OVRC_POSN                      equ 0006h
CWG1OCON0_OVRC_POSITION                  equ 0006h
CWG1OCON0_OVRC_SIZE                      equ 0001h
CWG1OCON0_OVRC_LENGTH                    equ 0001h
CWG1OCON0_OVRC_MASK                      equ 0040h
CWG1OCON0_OVRD_POSN                      equ 0007h
CWG1OCON0_OVRD_POSITION                  equ 0007h
CWG1OCON0_OVRD_SIZE                      equ 0001h
CWG1OCON0_OVRD_LENGTH                    equ 0001h
CWG1OCON0_OVRD_MASK                      equ 0080h
CWG1OCON0_CWG1STRA_POSN                  equ 0000h
CWG1OCON0_CWG1STRA_POSITION              equ 0000h
CWG1OCON0_CWG1STRA_SIZE                  equ 0001h
CWG1OCON0_CWG1STRA_LENGTH                equ 0001h
CWG1OCON0_CWG1STRA_MASK                  equ 0001h
CWG1OCON0_CWG1STRB_POSN                  equ 0001h
CWG1OCON0_CWG1STRB_POSITION              equ 0001h
CWG1OCON0_CWG1STRB_SIZE                  equ 0001h
CWG1OCON0_CWG1STRB_LENGTH                equ 0001h
CWG1OCON0_CWG1STRB_MASK                  equ 0002h
CWG1OCON0_CWG1STRC_POSN                  equ 0002h
CWG1OCON0_CWG1STRC_POSITION              equ 0002h
CWG1OCON0_CWG1STRC_SIZE                  equ 0001h
CWG1OCON0_CWG1STRC_LENGTH                equ 0001h
CWG1OCON0_CWG1STRC_MASK                  equ 0004h
CWG1OCON0_CWG1STRD_POSN                  equ 0003h
CWG1OCON0_CWG1STRD_POSITION              equ 0003h
CWG1OCON0_CWG1STRD_SIZE                  equ 0001h
CWG1OCON0_CWG1STRD_LENGTH                equ 0001h
CWG1OCON0_CWG1STRD_MASK                  equ 0008h
CWG1OCON0_CWG1OVRA_POSN                  equ 0004h
CWG1OCON0_CWG1OVRA_POSITION              equ 0004h
CWG1OCON0_CWG1OVRA_SIZE                  equ 0001h
CWG1OCON0_CWG1OVRA_LENGTH                equ 0001h
CWG1OCON0_CWG1OVRA_MASK                  equ 0010h
CWG1OCON0_CWG1OVRB_POSN                  equ 0005h
CWG1OCON0_CWG1OVRB_POSITION              equ 0005h
CWG1OCON0_CWG1OVRB_SIZE                  equ 0001h
CWG1OCON0_CWG1OVRB_LENGTH                equ 0001h
CWG1OCON0_CWG1OVRB_MASK                  equ 0020h
CWG1OCON0_CWG1OVRC_POSN                  equ 0006h
CWG1OCON0_CWG1OVRC_POSITION              equ 0006h
CWG1OCON0_CWG1OVRC_SIZE                  equ 0001h
CWG1OCON0_CWG1OVRC_LENGTH                equ 0001h
CWG1OCON0_CWG1OVRC_MASK                  equ 0040h
CWG1OCON0_CWG1OVRD_POSN                  equ 0007h
CWG1OCON0_CWG1OVRD_POSITION              equ 0007h
CWG1OCON0_CWG1OVRD_SIZE                  equ 0001h
CWG1OCON0_CWG1OVRD_LENGTH                equ 0001h
CWG1OCON0_CWG1OVRD_MASK                  equ 0080h

// Register: CWG1CON0
#define CWG1CON0 CWG1CON0
CWG1CON0                                 equ 0696h
// bitfield definitions
CWG1CON0_MODE_POSN                       equ 0000h
CWG1CON0_MODE_POSITION                   equ 0000h
CWG1CON0_MODE_SIZE                       equ 0003h
CWG1CON0_MODE_LENGTH                     equ 0003h
CWG1CON0_MODE_MASK                       equ 0007h
CWG1CON0_LD_POSN                         equ 0006h
CWG1CON0_LD_POSITION                     equ 0006h
CWG1CON0_LD_SIZE                         equ 0001h
CWG1CON0_LD_LENGTH                       equ 0001h
CWG1CON0_LD_MASK                         equ 0040h
CWG1CON0_EN_POSN                         equ 0007h
CWG1CON0_EN_POSITION                     equ 0007h
CWG1CON0_EN_SIZE                         equ 0001h
CWG1CON0_EN_LENGTH                       equ 0001h
CWG1CON0_EN_MASK                         equ 0080h
CWG1CON0_MODE0_POSN                      equ 0000h
CWG1CON0_MODE0_POSITION                  equ 0000h
CWG1CON0_MODE0_SIZE                      equ 0001h
CWG1CON0_MODE0_LENGTH                    equ 0001h
CWG1CON0_MODE0_MASK                      equ 0001h
CWG1CON0_MODE1_POSN                      equ 0001h
CWG1CON0_MODE1_POSITION                  equ 0001h
CWG1CON0_MODE1_SIZE                      equ 0001h
CWG1CON0_MODE1_LENGTH                    equ 0001h
CWG1CON0_MODE1_MASK                      equ 0002h
CWG1CON0_MODE2_POSN                      equ 0002h
CWG1CON0_MODE2_POSITION                  equ 0002h
CWG1CON0_MODE2_SIZE                      equ 0001h
CWG1CON0_MODE2_LENGTH                    equ 0001h
CWG1CON0_MODE2_MASK                      equ 0004h
CWG1CON0_G1EN_POSN                       equ 0007h
CWG1CON0_G1EN_POSITION                   equ 0007h
CWG1CON0_G1EN_SIZE                       equ 0001h
CWG1CON0_G1EN_LENGTH                     equ 0001h
CWG1CON0_G1EN_MASK                       equ 0080h
CWG1CON0_CWG1MODE_POSN                   equ 0000h
CWG1CON0_CWG1MODE_POSITION               equ 0000h
CWG1CON0_CWG1MODE_SIZE                   equ 0003h
CWG1CON0_CWG1MODE_LENGTH                 equ 0003h
CWG1CON0_CWG1MODE_MASK                   equ 0007h
CWG1CON0_CWG1LD_POSN                     equ 0006h
CWG1CON0_CWG1LD_POSITION                 equ 0006h
CWG1CON0_CWG1LD_SIZE                     equ 0001h
CWG1CON0_CWG1LD_LENGTH                   equ 0001h
CWG1CON0_CWG1LD_MASK                     equ 0040h
CWG1CON0_CWG1EN_POSN                     equ 0007h
CWG1CON0_CWG1EN_POSITION                 equ 0007h
CWG1CON0_CWG1EN_SIZE                     equ 0001h
CWG1CON0_CWG1EN_LENGTH                   equ 0001h
CWG1CON0_CWG1EN_MASK                     equ 0080h
CWG1CON0_CWG1MODE0_POSN                  equ 0000h
CWG1CON0_CWG1MODE0_POSITION              equ 0000h
CWG1CON0_CWG1MODE0_SIZE                  equ 0001h
CWG1CON0_CWG1MODE0_LENGTH                equ 0001h
CWG1CON0_CWG1MODE0_MASK                  equ 0001h
CWG1CON0_CWG1MODE1_POSN                  equ 0001h
CWG1CON0_CWG1MODE1_POSITION              equ 0001h
CWG1CON0_CWG1MODE1_SIZE                  equ 0001h
CWG1CON0_CWG1MODE1_LENGTH                equ 0001h
CWG1CON0_CWG1MODE1_MASK                  equ 0002h
CWG1CON0_CWG1MODE2_POSN                  equ 0002h
CWG1CON0_CWG1MODE2_POSITION              equ 0002h
CWG1CON0_CWG1MODE2_SIZE                  equ 0001h
CWG1CON0_CWG1MODE2_LENGTH                equ 0001h
CWG1CON0_CWG1MODE2_MASK                  equ 0004h

// Register: CWG1CON1
#define CWG1CON1 CWG1CON1
CWG1CON1                                 equ 0697h
// bitfield definitions
CWG1CON1_POLA_POSN                       equ 0000h
CWG1CON1_POLA_POSITION                   equ 0000h
CWG1CON1_POLA_SIZE                       equ 0001h
CWG1CON1_POLA_LENGTH                     equ 0001h
CWG1CON1_POLA_MASK                       equ 0001h
CWG1CON1_POLB_POSN                       equ 0001h
CWG1CON1_POLB_POSITION                   equ 0001h
CWG1CON1_POLB_SIZE                       equ 0001h
CWG1CON1_POLB_LENGTH                     equ 0001h
CWG1CON1_POLB_MASK                       equ 0002h
CWG1CON1_POLC_POSN                       equ 0002h
CWG1CON1_POLC_POSITION                   equ 0002h
CWG1CON1_POLC_SIZE                       equ 0001h
CWG1CON1_POLC_LENGTH                     equ 0001h
CWG1CON1_POLC_MASK                       equ 0004h
CWG1CON1_POLD_POSN                       equ 0003h
CWG1CON1_POLD_POSITION                   equ 0003h
CWG1CON1_POLD_SIZE                       equ 0001h
CWG1CON1_POLD_LENGTH                     equ 0001h
CWG1CON1_POLD_MASK                       equ 0008h
CWG1CON1_IN_POSN                         equ 0005h
CWG1CON1_IN_POSITION                     equ 0005h
CWG1CON1_IN_SIZE                         equ 0001h
CWG1CON1_IN_LENGTH                       equ 0001h
CWG1CON1_IN_MASK                         equ 0020h
CWG1CON1_CWG1POLA_POSN                   equ 0000h
CWG1CON1_CWG1POLA_POSITION               equ 0000h
CWG1CON1_CWG1POLA_SIZE                   equ 0001h
CWG1CON1_CWG1POLA_LENGTH                 equ 0001h
CWG1CON1_CWG1POLA_MASK                   equ 0001h
CWG1CON1_CWG1POLB_POSN                   equ 0001h
CWG1CON1_CWG1POLB_POSITION               equ 0001h
CWG1CON1_CWG1POLB_SIZE                   equ 0001h
CWG1CON1_CWG1POLB_LENGTH                 equ 0001h
CWG1CON1_CWG1POLB_MASK                   equ 0002h
CWG1CON1_CWG1POLC_POSN                   equ 0002h
CWG1CON1_CWG1POLC_POSITION               equ 0002h
CWG1CON1_CWG1POLC_SIZE                   equ 0001h
CWG1CON1_CWG1POLC_LENGTH                 equ 0001h
CWG1CON1_CWG1POLC_MASK                   equ 0004h
CWG1CON1_CWG1POLD_POSN                   equ 0003h
CWG1CON1_CWG1POLD_POSITION               equ 0003h
CWG1CON1_CWG1POLD_SIZE                   equ 0001h
CWG1CON1_CWG1POLD_LENGTH                 equ 0001h
CWG1CON1_CWG1POLD_MASK                   equ 0008h
CWG1CON1_CWG1IN_POSN                     equ 0005h
CWG1CON1_CWG1IN_POSITION                 equ 0005h
CWG1CON1_CWG1IN_SIZE                     equ 0001h
CWG1CON1_CWG1IN_LENGTH                   equ 0001h
CWG1CON1_CWG1IN_MASK                     equ 0020h

