GopalSaraf/Practicals/PSDL/include/proc/pic16lf1618.inc
// Register: SCANTRIG
#define SCANTRIG SCANTRIG
SCANTRIG                                 equ 071Dh
// bitfield definitions
SCANTRIG_TSEL_POSN                       equ 0000h
SCANTRIG_TSEL_POSITION                   equ 0000h
SCANTRIG_TSEL_SIZE                       equ 0008h
SCANTRIG_TSEL_LENGTH                     equ 0008h
SCANTRIG_TSEL_MASK                       equ 00FFh
SCANTRIG_TSEL0_POSN                      equ 0000h
SCANTRIG_TSEL0_POSITION                  equ 0000h
SCANTRIG_TSEL0_SIZE                      equ 0001h
SCANTRIG_TSEL0_LENGTH                    equ 0001h
SCANTRIG_TSEL0_MASK                      equ 0001h
SCANTRIG_TSEL1_POSN                      equ 0001h
SCANTRIG_TSEL1_POSITION                  equ 0001h
SCANTRIG_TSEL1_SIZE                      equ 0001h
SCANTRIG_TSEL1_LENGTH                    equ 0001h
SCANTRIG_TSEL1_MASK                      equ 0002h
SCANTRIG_TSEL2_POSN                      equ 0002h
SCANTRIG_TSEL2_POSITION                  equ 0002h
SCANTRIG_TSEL2_SIZE                      equ 0001h
SCANTRIG_TSEL2_LENGTH                    equ 0001h
SCANTRIG_TSEL2_MASK                      equ 0004h
SCANTRIG_TSEL3_POSN                      equ 0003h
SCANTRIG_TSEL3_POSITION                  equ 0003h
SCANTRIG_TSEL3_SIZE                      equ 0001h
SCANTRIG_TSEL3_LENGTH                    equ 0001h
SCANTRIG_TSEL3_MASK                      equ 0008h
SCANTRIG_SCANTSEL_POSN                   equ 0000h
SCANTRIG_SCANTSEL_POSITION               equ 0000h
SCANTRIG_SCANTSEL_SIZE                   equ 0008h
SCANTRIG_SCANTSEL_LENGTH                 equ 0008h
SCANTRIG_SCANTSEL_MASK                   equ 00FFh
SCANTRIG_SCANTSEL0_POSN                  equ 0000h
SCANTRIG_SCANTSEL0_POSITION              equ 0000h
SCANTRIG_SCANTSEL0_SIZE                  equ 0001h
SCANTRIG_SCANTSEL0_LENGTH                equ 0001h
SCANTRIG_SCANTSEL0_MASK                  equ 0001h
SCANTRIG_SCANTSEL1_POSN                  equ 0001h
SCANTRIG_SCANTSEL1_POSITION              equ 0001h
SCANTRIG_SCANTSEL1_SIZE                  equ 0001h
SCANTRIG_SCANTSEL1_LENGTH                equ 0001h
SCANTRIG_SCANTSEL1_MASK                  equ 0002h
SCANTRIG_SCANTSEL2_POSN                  equ 0002h
SCANTRIG_SCANTSEL2_POSITION              equ 0002h
SCANTRIG_SCANTSEL2_SIZE                  equ 0001h
SCANTRIG_SCANTSEL2_LENGTH                equ 0001h
SCANTRIG_SCANTSEL2_MASK                  equ 0004h
SCANTRIG_SCANTSEL3_POSN                  equ 0003h
SCANTRIG_SCANTSEL3_POSITION              equ 0003h
SCANTRIG_SCANTSEL3_SIZE                  equ 0001h
SCANTRIG_SCANTSEL3_LENGTH                equ 0001h
SCANTRIG_SCANTSEL3_MASK                  equ 0008h

// Register: CRCDATL
#define CRCDATL CRCDATL
CRCDATL                                  equ 0791h
// bitfield definitions
CRCDATL_DAT_POSN                         equ 0000h
CRCDATL_DAT_POSITION                     equ 0000h
CRCDATL_DAT_SIZE                         equ 0008h
CRCDATL_DAT_LENGTH                       equ 0008h
CRCDATL_DAT_MASK                         equ 00FFh
CRCDATL_DAT0_POSN                        equ 0000h
CRCDATL_DAT0_POSITION                    equ 0000h
CRCDATL_DAT0_SIZE                        equ 0001h
CRCDATL_DAT0_LENGTH                      equ 0001h
CRCDATL_DAT0_MASK                        equ 0001h
CRCDATL_DAT1_POSN                        equ 0001h
CRCDATL_DAT1_POSITION                    equ 0001h
CRCDATL_DAT1_SIZE                        equ 0001h
CRCDATL_DAT1_LENGTH                      equ 0001h
CRCDATL_DAT1_MASK                        equ 0002h
CRCDATL_DAT2_POSN                        equ 0002h
CRCDATL_DAT2_POSITION                    equ 0002h
CRCDATL_DAT2_SIZE                        equ 0001h
CRCDATL_DAT2_LENGTH                      equ 0001h
CRCDATL_DAT2_MASK                        equ 0004h
CRCDATL_DAT3_POSN                        equ 0003h
CRCDATL_DAT3_POSITION                    equ 0003h
CRCDATL_DAT3_SIZE                        equ 0001h
CRCDATL_DAT3_LENGTH                      equ 0001h
CRCDATL_DAT3_MASK                        equ 0008h
CRCDATL_DAT4_POSN                        equ 0004h
CRCDATL_DAT4_POSITION                    equ 0004h
CRCDATL_DAT4_SIZE                        equ 0001h
CRCDATL_DAT4_LENGTH                      equ 0001h
CRCDATL_DAT4_MASK                        equ 0010h
CRCDATL_DAT5_POSN                        equ 0005h
CRCDATL_DAT5_POSITION                    equ 0005h
CRCDATL_DAT5_SIZE                        equ 0001h
CRCDATL_DAT5_LENGTH                      equ 0001h
CRCDATL_DAT5_MASK                        equ 0020h
CRCDATL_DAT6_POSN                        equ 0006h
CRCDATL_DAT6_POSITION                    equ 0006h
CRCDATL_DAT6_SIZE                        equ 0001h
CRCDATL_DAT6_LENGTH                      equ 0001h
CRCDATL_DAT6_MASK                        equ 0040h
CRCDATL_DAT7_POSN                        equ 0007h
CRCDATL_DAT7_POSITION                    equ 0007h
CRCDATL_DAT7_SIZE                        equ 0001h
CRCDATL_DAT7_LENGTH                      equ 0001h
CRCDATL_DAT7_MASK                        equ 0080h
CRCDATL_CRCDAT_POSN                      equ 0000h
CRCDATL_CRCDAT_POSITION                  equ 0000h
CRCDATL_CRCDAT_SIZE                      equ 0008h
CRCDATL_CRCDAT_LENGTH                    equ 0008h
CRCDATL_CRCDAT_MASK                      equ 00FFh
CRCDATL_CRCDAT0_POSN                     equ 0000h
CRCDATL_CRCDAT0_POSITION                 equ 0000h
CRCDATL_CRCDAT0_SIZE                     equ 0001h
CRCDATL_CRCDAT0_LENGTH                   equ 0001h
CRCDATL_CRCDAT0_MASK                     equ 0001h
CRCDATL_CRCDAT1_POSN                     equ 0001h
CRCDATL_CRCDAT1_POSITION                 equ 0001h
CRCDATL_CRCDAT1_SIZE                     equ 0001h
CRCDATL_CRCDAT1_LENGTH                   equ 0001h
CRCDATL_CRCDAT1_MASK                     equ 0002h
CRCDATL_CRCDAT2_POSN                     equ 0002h
CRCDATL_CRCDAT2_POSITION                 equ 0002h
CRCDATL_CRCDAT2_SIZE                     equ 0001h
CRCDATL_CRCDAT2_LENGTH                   equ 0001h
CRCDATL_CRCDAT2_MASK                     equ 0004h
CRCDATL_CRCDAT3_POSN                     equ 0003h
CRCDATL_CRCDAT3_POSITION                 equ 0003h
CRCDATL_CRCDAT3_SIZE                     equ 0001h
CRCDATL_CRCDAT3_LENGTH                   equ 0001h
CRCDATL_CRCDAT3_MASK                     equ 0008h
CRCDATL_CRCDAT4_POSN                     equ 0004h
CRCDATL_CRCDAT4_POSITION                 equ 0004h
CRCDATL_CRCDAT4_SIZE                     equ 0001h
CRCDATL_CRCDAT4_LENGTH                   equ 0001h
CRCDATL_CRCDAT4_MASK                     equ 0010h
CRCDATL_CRCDAT5_POSN                     equ 0005h
CRCDATL_CRCDAT5_POSITION                 equ 0005h
CRCDATL_CRCDAT5_SIZE                     equ 0001h
CRCDATL_CRCDAT5_LENGTH                   equ 0001h
CRCDATL_CRCDAT5_MASK                     equ 0020h
CRCDATL_CRCDAT6_POSN                     equ 0006h
CRCDATL_CRCDAT6_POSITION                 equ 0006h
CRCDATL_CRCDAT6_SIZE                     equ 0001h
CRCDATL_CRCDAT6_LENGTH                   equ 0001h
CRCDATL_CRCDAT6_MASK                     equ 0040h
CRCDATL_CRDCDAT7_POSN                    equ 0007h
CRCDATL_CRDCDAT7_POSITION                equ 0007h
CRCDATL_CRDCDAT7_SIZE                    equ 0001h
CRCDATL_CRDCDAT7_LENGTH                  equ 0001h
CRCDATL_CRDCDAT7_MASK                    equ 0080h

