GopalSaraf/Practicals/PSDL/include/proc/pic16lf1618.inc
// Register: AT1ERRL
#define AT1ERRL AT1ERRL
AT1ERRL                                  equ 081Ch
// bitfield definitions
AT1ERRL_AT1ERR0_POSN                     equ 0000h
AT1ERRL_AT1ERR0_POSITION                 equ 0000h
AT1ERRL_AT1ERR0_SIZE                     equ 0001h
AT1ERRL_AT1ERR0_LENGTH                   equ 0001h
AT1ERRL_AT1ERR0_MASK                     equ 0001h
AT1ERRL_AT1ERR1_POSN                     equ 0001h
AT1ERRL_AT1ERR1_POSITION                 equ 0001h
AT1ERRL_AT1ERR1_SIZE                     equ 0001h
AT1ERRL_AT1ERR1_LENGTH                   equ 0001h
AT1ERRL_AT1ERR1_MASK                     equ 0002h
AT1ERRL_AT1ERR2_POSN                     equ 0002h
AT1ERRL_AT1ERR2_POSITION                 equ 0002h
AT1ERRL_AT1ERR2_SIZE                     equ 0001h
AT1ERRL_AT1ERR2_LENGTH                   equ 0001h
AT1ERRL_AT1ERR2_MASK                     equ 0004h
AT1ERRL_AT1ERR3_POSN                     equ 0003h
AT1ERRL_AT1ERR3_POSITION                 equ 0003h
AT1ERRL_AT1ERR3_SIZE                     equ 0001h
AT1ERRL_AT1ERR3_LENGTH                   equ 0001h
AT1ERRL_AT1ERR3_MASK                     equ 0008h
AT1ERRL_AT1ERR4_POSN                     equ 0004h
AT1ERRL_AT1ERR4_POSITION                 equ 0004h
AT1ERRL_AT1ERR4_SIZE                     equ 0001h
AT1ERRL_AT1ERR4_LENGTH                   equ 0001h
AT1ERRL_AT1ERR4_MASK                     equ 0010h
AT1ERRL_AT1ERR5_POSN                     equ 0005h
AT1ERRL_AT1ERR5_POSITION                 equ 0005h
AT1ERRL_AT1ERR5_SIZE                     equ 0001h
AT1ERRL_AT1ERR5_LENGTH                   equ 0001h
AT1ERRL_AT1ERR5_MASK                     equ 0020h
AT1ERRL_AT1ERR6_POSN                     equ 0006h
AT1ERRL_AT1ERR6_POSITION                 equ 0006h
AT1ERRL_AT1ERR6_SIZE                     equ 0001h
AT1ERRL_AT1ERR6_LENGTH                   equ 0001h
AT1ERRL_AT1ERR6_MASK                     equ 0040h
AT1ERRL_AT1ERR7_POSN                     equ 0007h
AT1ERRL_AT1ERR7_POSITION                 equ 0007h
AT1ERRL_AT1ERR7_SIZE                     equ 0001h
AT1ERRL_AT1ERR7_LENGTH                   equ 0001h
AT1ERRL_AT1ERR7_MASK                     equ 0080h
AT1ERRL_ERR0_POSN                        equ 0000h
AT1ERRL_ERR0_POSITION                    equ 0000h
AT1ERRL_ERR0_SIZE                        equ 0001h
AT1ERRL_ERR0_LENGTH                      equ 0001h
AT1ERRL_ERR0_MASK                        equ 0001h
AT1ERRL_ERR1_POSN                        equ 0001h
AT1ERRL_ERR1_POSITION                    equ 0001h
AT1ERRL_ERR1_SIZE                        equ 0001h
AT1ERRL_ERR1_LENGTH                      equ 0001h
AT1ERRL_ERR1_MASK                        equ 0002h
AT1ERRL_ERR2_POSN                        equ 0002h
AT1ERRL_ERR2_POSITION                    equ 0002h
AT1ERRL_ERR2_SIZE                        equ 0001h
AT1ERRL_ERR2_LENGTH                      equ 0001h
AT1ERRL_ERR2_MASK                        equ 0004h
AT1ERRL_ERR3_POSN                        equ 0003h
AT1ERRL_ERR3_POSITION                    equ 0003h
AT1ERRL_ERR3_SIZE                        equ 0001h
AT1ERRL_ERR3_LENGTH                      equ 0001h
AT1ERRL_ERR3_MASK                        equ 0008h
AT1ERRL_ERR4_POSN                        equ 0004h
AT1ERRL_ERR4_POSITION                    equ 0004h
AT1ERRL_ERR4_SIZE                        equ 0001h
AT1ERRL_ERR4_LENGTH                      equ 0001h
AT1ERRL_ERR4_MASK                        equ 0010h
AT1ERRL_ERR5_POSN                        equ 0005h
AT1ERRL_ERR5_POSITION                    equ 0005h
AT1ERRL_ERR5_SIZE                        equ 0001h
AT1ERRL_ERR5_LENGTH                      equ 0001h
AT1ERRL_ERR5_MASK                        equ 0020h
AT1ERRL_ERR6_POSN                        equ 0006h
AT1ERRL_ERR6_POSITION                    equ 0006h
AT1ERRL_ERR6_SIZE                        equ 0001h
AT1ERRL_ERR6_LENGTH                      equ 0001h
AT1ERRL_ERR6_MASK                        equ 0040h
AT1ERRL_ERR7_POSN                        equ 0007h
AT1ERRL_ERR7_POSITION                    equ 0007h
AT1ERRL_ERR7_SIZE                        equ 0001h
AT1ERRL_ERR7_LENGTH                      equ 0001h
AT1ERRL_ERR7_MASK                        equ 0080h
AT1ERRL_ERRL0_POSN                       equ 0000h
AT1ERRL_ERRL0_POSITION                   equ 0000h
AT1ERRL_ERRL0_SIZE                       equ 0001h
AT1ERRL_ERRL0_LENGTH                     equ 0001h
AT1ERRL_ERRL0_MASK                       equ 0001h
AT1ERRL_ERRL1_POSN                       equ 0001h
AT1ERRL_ERRL1_POSITION                   equ 0001h
AT1ERRL_ERRL1_SIZE                       equ 0001h
AT1ERRL_ERRL1_LENGTH                     equ 0001h
AT1ERRL_ERRL1_MASK                       equ 0002h
AT1ERRL_ERRL2_POSN                       equ 0002h
AT1ERRL_ERRL2_POSITION                   equ 0002h
AT1ERRL_ERRL2_SIZE                       equ 0001h
AT1ERRL_ERRL2_LENGTH                     equ 0001h
AT1ERRL_ERRL2_MASK                       equ 0004h
AT1ERRL_ERRL3_POSN                       equ 0003h
AT1ERRL_ERRL3_POSITION                   equ 0003h
AT1ERRL_ERRL3_SIZE                       equ 0001h
AT1ERRL_ERRL3_LENGTH                     equ 0001h
AT1ERRL_ERRL3_MASK                       equ 0008h
AT1ERRL_ERRL4_POSN                       equ 0004h
AT1ERRL_ERRL4_POSITION                   equ 0004h
AT1ERRL_ERRL4_SIZE                       equ 0001h
AT1ERRL_ERRL4_LENGTH                     equ 0001h
AT1ERRL_ERRL4_MASK                       equ 0010h
AT1ERRL_ERRL5_POSN                       equ 0005h
AT1ERRL_ERRL5_POSITION                   equ 0005h
AT1ERRL_ERRL5_SIZE                       equ 0001h
AT1ERRL_ERRL5_LENGTH                     equ 0001h
AT1ERRL_ERRL5_MASK                       equ 0020h
AT1ERRL_ERRL6_POSN                       equ 0006h
AT1ERRL_ERRL6_POSITION                   equ 0006h
AT1ERRL_ERRL6_SIZE                       equ 0001h
AT1ERRL_ERRL6_LENGTH                     equ 0001h
AT1ERRL_ERRL6_MASK                       equ 0040h
AT1ERRL_ERRL7_POSN                       equ 0007h
AT1ERRL_ERRL7_POSITION                   equ 0007h
AT1ERRL_ERRL7_SIZE                       equ 0001h
AT1ERRL_ERRL7_LENGTH                     equ 0001h
AT1ERRL_ERRL7_MASK                       equ 0080h

// Register: AT1ERRH
#define AT1ERRH AT1ERRH
AT1ERRH                                  equ 081Dh
// bitfield definitions
AT1ERRH_AT1ERR8_POSN                     equ 0000h
AT1ERRH_AT1ERR8_POSITION                 equ 0000h
AT1ERRH_AT1ERR8_SIZE                     equ 0001h
AT1ERRH_AT1ERR8_LENGTH                   equ 0001h
AT1ERRH_AT1ERR8_MASK                     equ 0001h
AT1ERRH_AT1ERR9_POSN                     equ 0001h
AT1ERRH_AT1ERR9_POSITION                 equ 0001h
AT1ERRH_AT1ERR9_SIZE                     equ 0001h
AT1ERRH_AT1ERR9_LENGTH                   equ 0001h
AT1ERRH_AT1ERR9_MASK                     equ 0002h
AT1ERRH_AT1ERR10_POSN                    equ 0002h
AT1ERRH_AT1ERR10_POSITION                equ 0002h
AT1ERRH_AT1ERR10_SIZE                    equ 0001h
AT1ERRH_AT1ERR10_LENGTH                  equ 0001h
AT1ERRH_AT1ERR10_MASK                    equ 0004h
AT1ERRH_AT1ERR11_POSN                    equ 0003h
AT1ERRH_AT1ERR11_POSITION                equ 0003h
AT1ERRH_AT1ERR11_SIZE                    equ 0001h
AT1ERRH_AT1ERR11_LENGTH                  equ 0001h
AT1ERRH_AT1ERR11_MASK                    equ 0008h
AT1ERRH_AT1ERR12_POSN                    equ 0004h
AT1ERRH_AT1ERR12_POSITION                equ 0004h
AT1ERRH_AT1ERR12_SIZE                    equ 0001h
AT1ERRH_AT1ERR12_LENGTH                  equ 0001h
AT1ERRH_AT1ERR12_MASK                    equ 0010h
AT1ERRH_AT1ERR13_POSN                    equ 0005h
AT1ERRH_AT1ERR13_POSITION                equ 0005h
AT1ERRH_AT1ERR13_SIZE                    equ 0001h
AT1ERRH_AT1ERR13_LENGTH                  equ 0001h
AT1ERRH_AT1ERR13_MASK                    equ 0020h
AT1ERRH_AT1ERR14_POSN                    equ 0006h
AT1ERRH_AT1ERR14_POSITION                equ 0006h
AT1ERRH_AT1ERR14_SIZE                    equ 0001h
AT1ERRH_AT1ERR14_LENGTH                  equ 0001h
AT1ERRH_AT1ERR14_MASK                    equ 0040h
AT1ERRH_AT1ERR15_POSN                    equ 0007h
AT1ERRH_AT1ERR15_POSITION                equ 0007h
AT1ERRH_AT1ERR15_SIZE                    equ 0001h
AT1ERRH_AT1ERR15_LENGTH                  equ 0001h
AT1ERRH_AT1ERR15_MASK                    equ 0080h
AT1ERRH_ERR8_POSN                        equ 0000h
AT1ERRH_ERR8_POSITION                    equ 0000h
AT1ERRH_ERR8_SIZE                        equ 0001h
AT1ERRH_ERR8_LENGTH                      equ 0001h
AT1ERRH_ERR8_MASK                        equ 0001h
AT1ERRH_ERR9_POSN                        equ 0001h
AT1ERRH_ERR9_POSITION                    equ 0001h
AT1ERRH_ERR9_SIZE                        equ 0001h
AT1ERRH_ERR9_LENGTH                      equ 0001h
AT1ERRH_ERR9_MASK                        equ 0002h
AT1ERRH_ERR10_POSN                       equ 0002h
AT1ERRH_ERR10_POSITION                   equ 0002h
AT1ERRH_ERR10_SIZE                       equ 0001h
AT1ERRH_ERR10_LENGTH                     equ 0001h
AT1ERRH_ERR10_MASK                       equ 0004h
AT1ERRH_ERR11_POSN                       equ 0003h
AT1ERRH_ERR11_POSITION                   equ 0003h
AT1ERRH_ERR11_SIZE                       equ 0001h
AT1ERRH_ERR11_LENGTH                     equ 0001h
AT1ERRH_ERR11_MASK                       equ 0008h
AT1ERRH_ERR12_POSN                       equ 0004h
AT1ERRH_ERR12_POSITION                   equ 0004h
AT1ERRH_ERR12_SIZE                       equ 0001h
AT1ERRH_ERR12_LENGTH                     equ 0001h
AT1ERRH_ERR12_MASK                       equ 0010h
AT1ERRH_ERR13_POSN                       equ 0005h
AT1ERRH_ERR13_POSITION                   equ 0005h
AT1ERRH_ERR13_SIZE                       equ 0001h
AT1ERRH_ERR13_LENGTH                     equ 0001h
AT1ERRH_ERR13_MASK                       equ 0020h
AT1ERRH_ERR14_POSN                       equ 0006h
AT1ERRH_ERR14_POSITION                   equ 0006h
AT1ERRH_ERR14_SIZE                       equ 0001h
AT1ERRH_ERR14_LENGTH                     equ 0001h
AT1ERRH_ERR14_MASK                       equ 0040h
AT1ERRH_ERR15_POSN                       equ 0007h
AT1ERRH_ERR15_POSITION                   equ 0007h
AT1ERRH_ERR15_SIZE                       equ 0001h
AT1ERRH_ERR15_LENGTH                     equ 0001h
AT1ERRH_ERR15_MASK                       equ 0080h
AT1ERRH_ERRH0_POSN                       equ 0000h
AT1ERRH_ERRH0_POSITION                   equ 0000h
AT1ERRH_ERRH0_SIZE                       equ 0001h
AT1ERRH_ERRH0_LENGTH                     equ 0001h
AT1ERRH_ERRH0_MASK                       equ 0001h
AT1ERRH_ERRH1_POSN                       equ 0001h
AT1ERRH_ERRH1_POSITION                   equ 0001h
AT1ERRH_ERRH1_SIZE                       equ 0001h
AT1ERRH_ERRH1_LENGTH                     equ 0001h
AT1ERRH_ERRH1_MASK                       equ 0002h
AT1ERRH_ERRH2_POSN                       equ 0002h
AT1ERRH_ERRH2_POSITION                   equ 0002h
AT1ERRH_ERRH2_SIZE                       equ 0001h
AT1ERRH_ERRH2_LENGTH                     equ 0001h
AT1ERRH_ERRH2_MASK                       equ 0004h
AT1ERRH_ERRH3_POSN                       equ 0003h
AT1ERRH_ERRH3_POSITION                   equ 0003h
AT1ERRH_ERRH3_SIZE                       equ 0001h
AT1ERRH_ERRH3_LENGTH                     equ 0001h
AT1ERRH_ERRH3_MASK                       equ 0008h
AT1ERRH_ERRH4_POSN                       equ 0004h
AT1ERRH_ERRH4_POSITION                   equ 0004h
AT1ERRH_ERRH4_SIZE                       equ 0001h
AT1ERRH_ERRH4_LENGTH                     equ 0001h
AT1ERRH_ERRH4_MASK                       equ 0010h
AT1ERRH_ERRH5_POSN                       equ 0005h
AT1ERRH_ERRH5_POSITION                   equ 0005h
AT1ERRH_ERRH5_SIZE                       equ 0001h
AT1ERRH_ERRH5_LENGTH                     equ 0001h
AT1ERRH_ERRH5_MASK                       equ 0020h
AT1ERRH_ERRH6_POSN                       equ 0006h
AT1ERRH_ERRH6_POSITION                   equ 0006h
AT1ERRH_ERRH6_SIZE                       equ 0001h
AT1ERRH_ERRH6_LENGTH                     equ 0001h
AT1ERRH_ERRH6_MASK                       equ 0040h
AT1ERRH_ERRH7_POSN                       equ 0007h
AT1ERRH_ERRH7_POSITION                   equ 0007h
AT1ERRH_ERRH7_SIZE                       equ 0001h
AT1ERRH_ERRH7_LENGTH                     equ 0001h
AT1ERRH_ERRH7_MASK                       equ 0080h

// Register: AT1CLK
#define AT1CLK AT1CLK
AT1CLK                                   equ 088Ch
// bitfield definitions
AT1CLK_CS_POSN                           equ 0000h
AT1CLK_CS_POSITION                       equ 0000h
AT1CLK_CS_SIZE                           equ 0001h
AT1CLK_CS_LENGTH                         equ 0001h
AT1CLK_CS_MASK                           equ 0001h
AT1CLK_AT1CS_POSN                        equ 0000h
AT1CLK_AT1CS_POSITION                    equ 0000h
AT1CLK_AT1CS_SIZE                        equ 0001h
AT1CLK_AT1CS_LENGTH                      equ 0001h
AT1CLK_AT1CS_MASK                        equ 0001h
AT1CLK_CS0_POSN                          equ 0000h
AT1CLK_CS0_POSITION                      equ 0000h
AT1CLK_CS0_SIZE                          equ 0001h
AT1CLK_CS0_LENGTH                        equ 0001h
AT1CLK_CS0_MASK                          equ 0001h
AT1CLK_AT1CS0_POSN                       equ 0000h
AT1CLK_AT1CS0_POSITION                   equ 0000h
AT1CLK_AT1CS0_SIZE                       equ 0001h
AT1CLK_AT1CS0_LENGTH                     equ 0001h
AT1CLK_AT1CS0_MASK                       equ 0001h

