GopalSaraf/Practicals/PSDL/include/proc/pic16lf1618.inc
#define Z11                              BANKMASK(PID1Z1L), 1
#define Z110                             BANKMASK(PID1Z1H), 2
#define Z111                             BANKMASK(PID1Z1H), 3
#define Z112                             BANKMASK(PID1Z1H), 4
#define Z113                             BANKMASK(PID1Z1H), 5
#define Z114                             BANKMASK(PID1Z1H), 6
#define Z115                             BANKMASK(PID1Z1H), 7
#define Z116                             BANKMASK(PID1Z1U), 0
#define Z12                              BANKMASK(PID1Z1L), 2
#define Z13                              BANKMASK(PID1Z1L), 3
#define Z14                              BANKMASK(PID1Z1L), 4
#define Z15                              BANKMASK(PID1Z1L), 5
#define Z16                              BANKMASK(PID1Z1L), 6
#define Z17                              BANKMASK(PID1Z1L), 7
#define Z18                              BANKMASK(PID1Z1H), 0
#define Z19                              BANKMASK(PID1Z1H), 1
#define Z20                              BANKMASK(PID1Z2L), 0
#define Z21                              BANKMASK(PID1Z2L), 1
#define Z210                             BANKMASK(PID1Z2H), 2
#define Z211                             BANKMASK(PID1Z2H), 3
#define Z212                             BANKMASK(PID1Z2H), 4
#define Z213                             BANKMASK(PID1Z2H), 5
#define Z214                             BANKMASK(PID1Z2H), 6
#define Z215                             BANKMASK(PID1Z2H), 7
#define Z216                             BANKMASK(PID1Z2U), 0
#define Z22                              BANKMASK(PID1Z2L), 2
#define Z23                              BANKMASK(PID1Z2L), 3
#define Z24                              BANKMASK(PID1Z2L), 4
#define Z25                              BANKMASK(PID1Z2L), 5
#define Z26                              BANKMASK(PID1Z2L), 6
#define Z27                              BANKMASK(PID1Z2L), 7
#define Z28                              BANKMASK(PID1Z2H), 0
#define Z29                              BANKMASK(PID1Z2H), 1
#define ZCD1EN                           BANKMASK(ZCD1CON), 7
#define ZCD1INTN                         BANKMASK(ZCD1CON), 0
#define ZCD1INTP                         BANKMASK(ZCD1CON), 1
#define ZCD1OUT                          BANKMASK(ZCD1CON), 5
#define ZCD1POL                          BANKMASK(ZCD1CON), 4
#define ZCDIE                            BANKMASK(PIE3), 4
#define ZCDIF                            BANKMASK(PIR3), 4
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nBOR                             BANKMASK(PCON), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRI                              BANKMASK(PCON), 2
#define nRMCLR                           BANKMASK(PCON), 3
#define nRWDT                            BANKMASK(PCON), 4
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWDTWV                           BANKMASK(PCON), 5
#define nWPUEN                           BANKMASK(OPTION_REG), 7

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16LF1618_INC_
